arr = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 5],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 1, 0, 3, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
    [0, 0, 0, 0, 0, 1, 0, 0, 0, 0],
    [0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
    [0, 0, 0, 0, 2, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [5, 0, 2, 0, 0, 0, 0, 0, 0, 0],
]
N = 10
# 상, 하, 좌, 우
dr = [-1, 1, 0, 0]
dc = [0, 0, -1, 1]

for r in range(N):
    for c in range(N):
        # 1 초과인 숫자 만큼 상하좌우에 -1로 채우기
        if arr[r][c] > 1:
            K = arr[r][c]
            for d in range(4):  
                # 해당 방향으로 K만큼 이동
                nr = r
                nc = c
                for _ in range(K):
                    nr = nr + dr[d]
                    nc = nc + dc[d]
                    if  0 <= nr < N and 0<= nc <N:
                        if arr[nr][nc] == 1:    # 못지나가는 벽
                            break
                        elif arr[nr][nc] != 0:  # 다른 숫자의 경우
                            continue
                        arr[nr][nc] = -1

for row in arr:
    print(row)
