# 트리
# 한개이상의 노드로 이루어진 유한 집합
# 노드 중 최상위 노드를 루트라고 하고 말단은 잎 노드라고 한다.
# 나머지 노드들은 각각 하나의 트리가 된다. 루트의 부 트리라고 한다. 

# 형제노드, 조상노드, 서브트리, 자손노드
# 노드의 차수, 트리의 차수 - 트리에 있는 노드의 차수 중에서 가장 큰 값
# 노드의 높이 : 루트에서 노드에 이르는 간선의 수, 노드의 레벨

# 이진트리(binary tree)
# 자식이 최대 두개인 트리

# 포화 이진 트리
# 모든 레벨에 노드가 포화상태로 차 있는 이진 트리

# 완전 이진 트리
# 편향 이진 트리

# 이진 트리의 순회
# 전위순회, 중위순회, 후위순회

print("====================================================================")

# 용어들 익히기
# 순회 순서 익히기


# 특별한 규칙없으면 어쩌지, 완전이면 어쩌지? 순회를 잘 이해하고, 욕심내면 힙,, 이해하기 손으로 먼저 
# 그다음 삽입, 삭제 차례차례 이진탐색트리는 구현은 아니지만 이런게 있다. 정도의 이해